Namorix/namorix-weave/firmware/border-router-host/sdkconfig.defaults
# Thread Border Router: ESP32-S3 Host + ESP32-H2 RCP via SPI. No WiFi/Ethernet.
# UART reserved for RCP flash/update later.

CONFIG_IDF_TARGET="esp32s3"

#
# Serial flasher
#
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y
# Custom header: enable to include br_custom_config.h (SRP server + CLI srp server/srp client)
CONFIG_OPENTHREAD_HEADER_CUSTOM=y
CONFIG_OPENTHREAD_CUSTOM_HEADER_PATH="include"
CONFIG_OPENTHREAD_CUSTOM_HEADER_FILE_NAME="br_custom_config.h"

#
# Compiler
#
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_NEWLIB_NANO_FORMAT=y

#
# mbedTLS (Thread/DTLS)
#
CONFIG_MBEDTLS_CMAC_C=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECJPAKE=y
CONFIG_MBEDTLS_ECJPAKE_C=y

#
# OpenThread
#
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_BORDER_ROUTER=y
CONFIG_OPENTHREAD_BORDER_AGENT_ENABLE=y
CONFIG_OPENTHREAD_COMMISSIONER=y
CONFIG_OPENTHREAD_CLI_OTA=n
CONFIG_OPENTHREAD_RCP_COMMAND=y
CONFIG_OPENTHREAD_RADIO_SPINEL_SPI=y
# CONFIG_OPENTHREAD_RADIO_SPINEL_UART is not set
CONFIG_OPENTHREAD_RADIO_TREL=n
CONFIG_OPENTHREAD_TASK_SIZE=8192
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_SRP_CLIENT_MAX_SERVICES=5

#
# OpenThread Border Router Example
#
CONFIG_ESP_BR_H2_TARGET=y

#
# lwIP
#
CONFIG_LWIP_IPV6_FORWARD=y
CONFIG_LWIP_IPV6_NUM_ADDRESSES=12
CONFIG_LWIP_MULTICAST_PING=y
CONFIG_LWIP_NETIF_STATUS_CALLBACK=y
CONFIG_LWIP_HOOK_IP6_ROUTE_DEFAULT=y
CONFIG_LWIP_HOOK_ND6_GET_GW_DEFAULT=y
CONFIG_LWIP_HOOK_IP6_INPUT_CUSTOM=y
CONFIG_LWIP_IPV6_AUTOCONFIG=y
CONFIG_LWIP_HOOK_IP6_SELECT_SRC_ADDR_CUSTOM=y
CONFIG_LWIP_FORCE_ROUTER_FORWARDING=y

#
# ESP System
#
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=3584
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

#
# Border Router board / console
#
CONFIG_ESP_BR_BOARD_DEV_KIT=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
# CONFIG_ESP_CONSOLE_USB_CDC is not set
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG is not set
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
# CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG is not set
# USB CDC used for frame only; log/console only to UART (no output to USB)

#
# RCP: BR <-> RCP only via SPI. Pins in menuconfig (BR_RCP_SPI_*, BR_RCP_RESET_GPIO, BR_RCP_BOOT_GPIO).
# OpenThread: enable CONFIG_OPENTHREAD_RADIO_SPINEL_SPI in the OpenThread menu.
#

#
# HTTP server
#
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
